// Напишите программу, которая выводит случайное трёхзначное число и
// удаляет вторую цифру из этого числа.

// int firstDigit = number / 10;  //здесь целочисленное деление, остаток отбрасывается
// int secondDigit = number % 10; //здесь получаем остаток от деления на 10


int number = new Random().Next(100, 1000);
Console.WriteLine($"Случайное трехзначное число => {number}");

int firstDigit = 